[[{"Customer":"Abba Contract"},{"Customer":"http://www.abbacontract.com"},{"Customer":"6/2/14: Laura mentioned that they reached out via linkedin that they were looking for an installer in Houston."},{"Customer":"Above the Sill"},{"Customer":"http://abovethesill.net/"},{"Customer":"5/09 - came across online b/c a distributor for Coral's Simply 66 line"},{"Customer":"Alderman Acres Manufacturing"},{"Customer":"https://aldermanacres.com/wp/"},{"Customer":"Ameritex"},{"Customer":"https://ameritexinternational.americommerce.com/"},{"Customer":"hospitality only?"},{"Customer":"HD Expo exhibitor"},{"Customer":"Anderson "},{"Customer":"www.andersonfabrics.com"},{"Customer":"Now part of The Shade Store family of companies"},{"Customer":"Shuster's previous long-time fabricator"},{"Customer":"7/9/14.  Dave Baer at EM Associates mentioned that he uses them for WTs.  Looked online: 300 employees and 135K sq ft"},{"Customer":"Anthony Group"},{"Customer":"https://www.anthcorp.com/"},{"Customer":"Virginia Beach, VA"},{"Customer":"8/24/22: contacted Mike Jones and Fay Jones through LinkedIn to see if he'd be willing to chat. Tried old work number but not in service."},{"Customer":"8/23/22: website no longer available. From WaybackMachine:"},{"Customer":"C. Fay Jones, President: Fay established Anthony Corporation in 1987 after 13 years managing another commercial drapery firm. Before that, she worked with a drapery firm in Washington, DC that fabricated window treatments for designers & decorators. The DC firm’s clients included government offices, embassies and residential homes thru the trade. "},{"Customer":"Mike Jones, Business Manager: Mike manages the daily operation of Anthony Corporation. He is customer service, production scheduler, installation scheduling, financing and human resources. He is the “fixer” for the whole operation. Mike is the computer guy, money man and go-to person for problems, solutions and issues. Whether it is employees or customer issues, Mike handles it all. He is the guy to start with if we are not meeting your expectations, he will track down the issue and get it handled for you. He has the gray hair to match his position responsibilities and can even handle his mother when necessary."},{"Customer":"Donna Williford, Project Management: Donna’s exposure to the window treatment business began in St. Louis, Missouri when she married Larry, Anthony’s Installation Supervisor. She then joined his business as manager and installation assistant. Together they accomplished installations all over the country. Prior to working with Larry, Donna worked at West Virginia University for over 30 years specializing in office management and program management. Donna enjoys working with her husband in a family owned business, and views it as an amazing way to spend her workdays. She is a certified beach person who’s motto is: “Don’t sweat the small stuff, life is too important.”"},{"Customer":"Steven (or \"Stephen\"?) Jones, Operations: Stephen, our resident “foodie” was added to Anthony’s payroll while in High School in our warehouse. He traveled extensively for over 10 years doing installations all over the country. He has learned the business from the lowest rung on the ladder to assisting in all departments. Stephen delivers the best possible experience to our customers, under the mentorship of three generations of family – which works surprisingly well, considering. We are just waiting for his son to get a little older to add him to the family mix."},{"Customer":"Larry Williford, Installation Supervisor: Larry joined Anthony Corporation in 2017. Prior to moving to Virginia Beach, he owned a window treatment installation company in St. Louis, Missouri. His over 30 years in the industry includes such fascinating venues as the Library of Congress, Statutory Hall, cruise ships, State Capital Building in Missouri, and the Federal Courtroom in Boston Massachusetts. The types of treatments he has installed are as unlimited as the situations, including motorization. Larry is a self-admitted perfectionist, as evidenced by the vast geography he has covered. Larry is also a certified beach person and motorcyclist."},{"Customer":"5/3/22: email from Ryan that they closed"},{"Customer":"AR Nelson"},{"Customer":"http://www.arnelson.com/"},{"Customer":"5/1/14: talked with Sherry Darlington.  Owned by Golterman & Sabo.  Outsource production of CCs but make their own track"},{"Customer":"8/09 - Danna mentioned"},{"Customer":"B. Lazarus"},{"Customer":"8/5/22: Ryan mentioned Eric Lazarus doing Doug Lynn type work for Coral Aperture (blinds and shades)"},{"Customer":"10/29/10 - learned from Marvin at Star Silk that they went out of business in summer '10.  What is the relationship to Lazarus Manufacturing? (http://lazarusmanufacturing.com/)"},{"Customer":"4/9/09 - received an order from Florida Star which we believe was meant for B. Lazurus "},{"Customer":"Barjan"},{"Customer":"http://www.barjan-mfg.com/"},{"Customer":"Barwick Inn Fashion"},{"Customer":"http://www.barwickinnfashion.com/"},{"Customer":"5/20/22: Michelle mentioned again."},{"Customer":"6/13/16: Ryan emailed that Encompass uses them for COM BSs."},{"Customer":"Bramson House"},{"Customer":"http://www.bramsonhouse.com/"},{"Customer":"6/3/22: Rene mentioned"},{"Customer":"Brite Inc."},{"Customer":"http://www.briteinc.com/"},{"Customer":"Carole Fabrics"},{"Customer":"https://www.carolefabrics.com/"},{"Customer":"owned by Hunter Douglas, which was acquired by 3G Capital in 2022"},{"Customer":"Catalina Curtain Company "},{"Customer":"http://www.sereneview.com/"},{"Customer":"Colton Inc "},{"Customer":"https://www.coltoninc.com/"},{"Customer":"Utah"},{"Customer":"Founded in 1955, Colton Inc. has seen three generations of leaders in commercial window covering design and manufacture at the helm."},{"Customer":"Feb 2023: stumbled across online."},{"Customer":"Commercial Window Coverings Group "},{"Customer":"http://www.commercialwindowcovering.com/"},{"Customer":"11/16/15: saw their booth at Healthcare Design show in DC.  They prominently displayed Metro/Timber logo"},{"Customer":"ConFab"},{"Customer":"http://www.confab-carole.com/"},{"Customer":"5/1/09 - Marvin at Star Silk mentioned "},{"Customer":"Contract Decor "},{"Customer":"https://www.contractdecor.net/ "},{"Customer":"Thousand Palms, CA"},{"Customer":"5/18/11 - met President and San Antonio sales guy at HD Expo in Vegas.  Nice enough.  They were familiar with David White, Donna, etc"},{"Customer":"7/10 - they won large State of TX project that we bid through Indoff and multiple others.  Their winning bid was less than we would have charged our customers"},{"Customer":"Contract Decor International"},{"Customer":"http://www.contractdecor.com/"},{"Customer":"Nov 2017: purchased by Valley Forge Fabrics"},{"Customer":"summer 08: put in touch with Mike Handler by Amy Chen when evaluating HCI"},{"Customer":"County Draperies"},{"Customer":"http://drape.com/index.php"},{"Customer":"orders some CCs from HCI"},{"Customer":"CS Construction Specialties"},{"Customer":"http://www.c-sgroup.com/cubicle-track-curtains"},{"Customer":"General Cubicle, a C/S Group (Construction Specialties) company "},{"Customer":"Dave's (previous salesman at Interspec) family used to own it"},{"Customer":"4/15/11:  CCs came in from PDV Associates to be shortened and re-hemmed.  CS tags: \"product of USA, assembled in Mexico\""},{"Customer":"8/3/10: met Jim McLain at HPSI trade show.  He confirmed that they are still manufacturing their own CCs"},{"Customer":"5/07/09 - Kelly at InPro mentioned that General Cubicle is likely to distribute \"On the Right Track\" hookless cubicle system"},{"Customer":"Covoc "},{"Customer":"http://www.covoc.com/"},{"Customer":"found thru Google"},{"Customer":"          "},{"Customer":"Creative Draperies "},{"Customer":"http://www.creativedraperies.com"},{"Customer":"4/14: Nancy Semon mentioned that owner called her about job.  She would create drapery line for healthcare."},{"Customer":"3/20/12:  Alison Thompson called b/c their customer asked them to quote a large job where Seaspice has been specced.  She gave me sell job, mentioned that they work with Tanatex and Medline before I explained what we do.  They are very similar to us, but also work in hospitality.  Explained to her that we also fabricate but fudged that source Seaspice in Asia.  "},{"Customer":"2/24/12:  Bill Carter mentioned that he had a lead on 3 wide quilting machines that Creative might sell."},{"Customer":"Cubicle Curtain Factory "},{"Customer":"http://www.cubiclecurtainfactory.com/"},{"Customer":"Decorator Industries "},{"Customer":"http://www.decoratorindustries.com/"},{"Customer":"previously a public company before de-listing"},{"Customer":"HCI customer and competitor"},{"Customer":"11/13/13: Ron Swank, new Coral rep, used to work there"},{"Customer":"6/6/12:  received fax with new credit info / cover letter that Dan Hannula purchased Decorator Industries of Wisconsin"},{"Customer":"3/30/12: ML Weaver said that they are Chap 7, no longer exist"},{"Customer":"Delta Contract Interiors"},{"Customer":"10/31/17: shortly after showing Demi Moon fabric to Sharon Hancock of RLI, we received a quote request from Delta Contract for fabric only.  Must be Sharon's long-time WT fabricator."},{"Customer":"Design District "},{"Customer":"https://www.designdistrictdrapes.com/"},{"Customer":"Bob Lipsky, Owner/Treasurer. Born 1946?"},{"Customer":"Marshall Eskridge passed away Jan 27, 2022"},{"Customer":"Ron Lipsky, Sales/Operations, handles all the tech"},{"Customer":"Jason Eskridge, Custom Coordinator"},{"Customer":"Dustin Eskridge, Contract Coordinator"},{"Customer":"1/24/23: lunch w/ Bob at Pappasitos"},{"Customer":"Best year ever. Dustin has done a good job replacing Marshall. None of the 3 boys want to be in charge, or want to be 100+% in the business. Ron's step-daughter, 11yo, started having heart attacks 3 weeks ago, not sure if she'll fully recover. He's been out and distracted. Sad, but the point is all 3 always seem to have something going on to take them away from the company. Have hired a couple of assistants to help: 1 is good, the other is flaky. Calico Corners guy brought down the owner of Fabricut recently. I don't fully understand why...sounds like Calico would like to be able to be the custom manufacturer for Fabricut. Fabricut's own workroom outside of Tulsa is on indian territory (tax breaks) and 120,000 sf. Great at the stuff that is programmed in their system but also want to be able to make more custom products. Calico LOI still in place. Was scheduled to close at end of March but they've asked to push 2 weeks until mid-April b/c of cash flows from different businesses. Probably need to"},{"Customer":"9/7/22 lunch with Bob at IHOP. "},{"Customer":"Ron handles all technology, including converting their Excel files to Access database. Dustin as knowledgeable as Marshall but friendlier. Jason not good."},{"Customer":"Were in Philly the day before Marshall died to finalize LOI for sale to Calico Corners. Marshall was walking into the building to announce the sale to employees when he died. "},{"Customer":"Calico wants in-house manufacturing b/c burned by other workrooms getting purchased by Shade Store (Anderson, Virginia Quilting, someone in California). Calico was purchased in 2019 https://www.fabricsandfurnishings.com/fabric-features/Amitabh-and-Supriya-Himatsingka-Buy-Into-Calico-Specialty-Retailer-of-Decorative-Fabrics.html. New owner wants to expand from 60 to 100 stores. Sale price is around $2mm. Currently at a $200K discount b/c of Marshall's passing and b/c rent is going up significantly. Building was purchased so sweetheart rent deal going away: will be $20K/mos for 25,000 sf. W2 wages Marshall $140K, Bob $120K. Marshall owned 60%, Bob 40%. Marshall did not have a will so stuck in probate even though Marshall's wife has said should pass to the boys (so Bob 40%, Dustin 30%, Jason 30%). Bob opposed to further nickel and diming by Calico but boys might outvote him since they won't have any tax on the sale. "},{"Customer":"Marshall's wife was adopted, her adopted mother died with a $15mm estate which she donated to alzheimer's foundation, gets around $8K/mos from the estate's interest and can live comfortably on that. Calico is 25% of revenue, but less of profit. Another significant customer is AEC https://aeccorp.com/, near HCI (where Brandon Wiechmann was CFO briefly, we had call with Director of Sales, Crystal Durham, back in early 2020)."},{"Customer":"Diamond Drapery "},{"Customer":"www.diamonddrapery.com"},{"Customer":"made \"Parallel\" CCs for HD Supply"},{"Customer":"10/8/20: talked with Adam Jurlin"},{"Customer":"9/12/13: met w/ Chuck Hogan of Architex - he walked us through his Diamond Drapery / Spec-Tex history.  Spec-Tex started by Diamond Drapery son, Adam.  Separate company, but Diamond Drapery did all of the fabrication.  Said that Adam is a genius but often misunderstood for being brash.  Spec-Tex ran out of money b/c grew too quickly.  Fabtex bought the rights to Spec-Tex  "},{"Customer":"5/1/12:  learned on conf call with HD Supply that they are looking for new CC vendor.  Sounds like something bad happened with Diamond Drapery.  Called Rick at Ispec and he confirmed that things have been tough.  Parents had to take back over from the son ~1 year ago.  He would underbid big projects in the interest of \"winning\" and also got stuck with too much fabric that he had converted directly (parents had never done that)."},{"Customer":"2/20/12:  Lance Keziah at Crypton mentioned that they buy direct from Bentex"},{"Customer":"5/5/11:  called Rick at Interspec.  Confirmed that they do not have good relationship with Diamond.  Son took over the business and he's highly competitive.  Accused Ispec of quality and timing issues that did not exist.  Also knocked off a few fabrics"},{"Customer":"5/4/11:  Lesli at HD Supply mentioned that they do not have Windsor b/c their vendor can't source.  "},{"Customer":"8/5/10: Jess Braun at DS emailed Lisa re getting a sample from them"},{"Customer":"Drapery Industries"},{"Customer":"http://www.draperyindustries.com/"},{"Customer":"10/12/11: Luis found that they have a snap tape system through web search"},{"Customer":"Drapery Manufacturing (DMI)"},{"Customer":"http://www.dmiok.com"},{"Customer":"5/16/13:  Andy Noon at APN mentioned that they use them for CCs and generally happy"},{"Customer":"Eagle Contract "},{"Customer":"http://eaglecontract.com/"},{"Customer":"Echota Fabrics "},{"Customer":"https://echotafabrics.com/"},{"Customer":"re quilting machine search..."},{"Customer":"Zane Holland, VP of manufacturing"},{"Customer":"1/20/12:  called and eventually got connected to Zane.  Have 2 computerized machines that they would sell.  One (or both?) is lock-stitch, Gribetz, 140”, #10, 3-needle bar.  He will talk with President and call back with price."},{"Customer":"8/17/11:  John the Dogbed Man visited HCI for cash payment and confirmed that they have a workroom for WTs and other items"},{"Customer":"8/16/11:  Jennifer Fero at HP Products mentioned that they manufacture her WTs so clearly they are a competitor and unusable"},{"Customer":"8/2/11: John the Dogbed Man mentioned them as an option but could not find them online"},{"Customer":"EE Sewing "},{"Customer":"https://www.eesewing.com/"},{"Customer":"4/26/12: learned that Hodell using them for drapes for their big Okinawa project"},{"Customer":"talked to Luke during Quilting Operation Set-up process."},{"Customer":"Fabricare Draperies "},{"Customer":"www.fabricare1.com no longer working"},{"Customer":"Maryland"},{"Customer":"10/14/22: Matt Keller texted photo of curtain with their tag in their hospital baby room w/ Grace. Can't find much online. Did they close? LinkedIn: Daniel Abramson - President - One Wall At A Time LLC had been VP and Shelly Abramson is CFO"},{"Customer":"Fabriquilt "},{"Customer":"http://www.fabri-quilt.com/"},{"Customer":"Barry"},{"Customer":"Warp & Phil by Fabri-Quilt is the merger of two leading companies – a fabricator of hospitality bed coverings and window treatments, and a producer of fresh and innovative decorative fabrics. "},{"Customer":"4/26/12: learned that Hodell using them for bedding for their big Okinawa project"},{"Customer":"Fabritex"},{"Customer":"Arnie Pedersen"},{"Customer":"11/1/17: Ryan said that we're shipping fabric for Graham Field's Michael Smith projects to Arnie Peterson of Fabritex in Houston."},{"Customer":"Fabtex "},{"Customer":"http://www.fabtex.com"},{"Customer":"http://www.fabricsandfurnishings.com/corrugated-box-king-michael-feterik-buys-fabtex-inc-from-robert-snyder/ "},{"Customer":"10/8/20: talked with Adam Jurlin"},{"Customer":"11/13/13: Ron Swank, new Coral rep, used to work there"},{"Customer":"9/12/13: met w/ Chuck Hogan of Architex - he walked us through his Diamond Drapery / Spec-Tex history.  Spec-Tex started by Diamond Drapery son, Adam.  Separate company, but Diamond Drapery did all of the fabrication.  Said that Adam is a genius but often misunderstood for being brash.  Spec-Tex ran out of money b/c grew too quickly.  Fabtex bought the rights to Spec-Tex  "},{"Customer":"3/1/11: Jason from Integra stopped in and ended up discussing Fabtex.  They had been one of Integra's largest customers, but then started converting their own fabric.  Jason not happy about it"},{"Customer":"2/24/11: saw FabTex CCs at Dr. Jacobe's renovated office"},{"Customer":"FR Cubicle Curtains And Drapes "},{"Customer":"http://www.frcubiclecurtainsanddrapes.com/"},{"Customer":"Haiguard "},{"Customer":"https://haiguard.com/"},{"Customer":"5/7/20: Ryan emailed"},{"Customer":"Hinkel "},{"Customer":"http://www.hinkelinc.com/"},{"Customer":"8/19/15: learned from David Pennell at Pencare that Hinkel was purchased.  Looked it up online and InPro was buyer."},{"Customer":"9/27/12:  Julie Brendell mentioned them as a competitor (to both her b/c they sell direct and to HCI b/c they fabricate)"},{"Customer":"9/27/12:  Wendy Adams at Joerns said that she has used them"},{"Customer":"Hospi-tel "},{"Customer":"http://www.hospitel.com/home.htm"},{"Customer":"late 2015 / early 2016: out of business"},{"Customer":"~3/09 - currently used by Burrows -Owens & Minor per Gary Goldfarb"},{"Customer":"5/09 - David White mentioned as one of the largest competitors.  He thinks that they are willing to sell direct"},{"Customer":"June Tailor "},{"Customer":"https://www.junetailor.com/"},{"Customer":"5/29/22: looked at website...no longer making WTs?"},{"Customer":"10/07/09: saw June Tailor booth at Aptura vendor fair"},{"Customer":"10/6/09: Kelly said that InPro uses June Tailor for window treatments"},{"Customer":"Imperial Fastener Company "},{"Customer":"http://www.imperialfastener.com/index.php"},{"Customer":"Brandon Bernardo (mention Dave Mayer of Clean Bottle)"},{"Customer":"2/1/23: found deal terms on Searchfunder, saved to Exit"},{"Customer":"12/12/13: Cindy Knickmeyer of Phoenix cc'd me on a rush track quote request for which she had not previously received a response.  I think that she mistakenly copied me, it was probably intended for Douglas Frawley"},{"Customer":"10/7/13: met Douglas Frawley at AHCA show in Phoenix.  I just stopped by their booth and introduced myself.  They don't make BSs or WTs.  Not very chatty."},{"Customer":"4/30/09 - Marvin at Star Silk mentioned that Harbor uses them"},{"Customer":"5/09 - David White mentioned as one of the largest competitors.  He thinks that they are willing to sell direct"},{"Customer":"Indecor "},{"Customer":"http://www.indecorinc.com/"},{"Customer":"10/23/17: Ryan forwarded email on which KDI copied them."},{"Customer":"InPro "},{"Customer":"http://www.inprocorp.com/"},{"Customer":"JS Fiber "},{"Customer":"http://www.jsfiber.com/"},{"Customer":"Bedspreads for HD Supply and others"},{"Customer":"Kartri "},{"Customer":"http://www.kartri.com/index.html"},{"Customer":"5/27/09 - Trish called from Katri.  Offered to send new price list and mentioned that they're now making cubicle curtains in Pennsylvania"},{"Customer":"Kay & L Draperies"},{"Customer":"http://www.kayandl.com "},{"Customer":"Waverly, Iowa"},{"Customer":"11/15/19: used by Presbyterian / Senior Lifestyle per Michelle"},{"Customer":"KemTex Services "},{"Customer":"http://www.kemtex.com/index.html"},{"Customer":"KemTex Contract http://www.kemtexcontract.com/index.html"},{"Customer":"Dallas-based"},{"Customer":"6/11/21: left a vmail for Matt."},{"Customer":"6/11/21: asked some questions of Chelsea.  Matt is the owner, Marty is not (not 100% clear).  Marty is more active in the biz but Matt shows up too.  There are actually 2 business: KemTex Services (cleaning) and KemTex Contract (WTs fabrication).  Ed is the only one who knows anything about the Contract side, he does everything from estimating thru project mgmt.  In his 80s but doing well other than he forgets things from time to time.  Much of the business comes from hotels, not shared customers with Services."},{"Customer":"12/6/19: Matt Stern appears to own with his brother, Marty.  Learned at da Vinci xmas dinner that Matt lives at 4651 Irvin Simmons, across the street from a da Vinci family, Lexi and Ken Moore."},{"Customer":"3/7/12:  called Ed Gold and asked him about Merlin cutting system.  He's a fan.  Generally friendly.  Business not bad.  They moved from Manana to a 56K ft facility which they bought"},{"Customer":"10/6/09: Danna mentioned as comp, doesn't trust Ed Gold."},{"Customer":"Kenco "},{"Customer":"https://kencohospitality.com/"},{"Customer":"Gary Kenny in Ft. Lauderdale"},{"Customer":"for sale"},{"Customer":"2022: Rene and Ricardo visited to see Eisenkolb equipment, Ryan talked with by phone but did not discuss a sale"},{"Customer":"10/8/20: per Ryan per David at Atelier"},{"Customer":"Kite's Custom Interiors "},{"Customer":"http://www.kitesinteriors.com/"},{"Customer":"Fort Worth.  Cheryl Hawk worked there for years."},{"Customer":"L&D Upholstery "},{"Customer":"http://l-n-d.com/"},{"Customer":"10/19/09: Rick Deacon mentioned that they are the largest cubicle player in Houston."},{"Customer":"Laacke & Joys "},{"Customer":"http://www.laackemfg.com/"},{"Customer":"Maine Stitching"},{"Customer":"https://mainestitching.com/ "},{"Customer":"previously Dirigo Stitching"},{"Customer":"Maine"},{"Customer":"6/3/22: Rene confirmed have a facility that does WTs"},{"Customer":"4/4/17: John Rennie - he used to send COM work there, he said that Dirigo Stitching in Maine was bought last year by a ski hill operator.  Changed name to Maine Stitching and picked up a big LL Bean order. "},{"Customer":"http://www.centralmaine.com/2015/03/21/skowhegans-maine-stitching-specialties-is-manufacturing-a-success-story/"},{"Customer":"http://www.pressherald.com/2015/03/22/maine-stitching-specialties-to-expand-at-skowhegan-site/"},{"Customer":"http://bangordailynews.com/2016/07/04/business/skowhegan-firm-aims-to-sell-10000-maine-made-us-flags/"},{"Customer":"6/4/14: Bob Montani said that Harbor is sending CC biz there and using COM fabric and mesh.  Dirt cheap."},{"Customer":"Majestic Fabricators (Sterling?)"},{"Customer":"12/17/15: shipped roll of fabric for Medline to Majestic"},{"Customer":"4/27/11:  Rick at Interspec said that they are fabricating for Medline"},{"Customer":"10/19/09: Rick Deacon mentioned them as a competitor in Missouri.  Cannot find website"},{"Customer":"Marietta Drapery "},{"Customer":"http://www.mariettadrapery.com/"},{"Customer":"Martex / WestPoint Home "},{"Customer":"http://martex.com/"},{"Customer":"Bedspreads for HD Supply, Star Linen, and others"},{"Customer":"Merrill Y. Landis "},{"Customer":"http://mylltd.com/"},{"Customer":"6/5/13:  Brian Jackson noted that they use Merrill Landis for high-end residential type treatments, but that for commercial work they prefer HCI b/c (1) price (2) turnaround time.  Merrill Landis has better quality, though, and I acknowledged that we do not try to have residential-type quality"},{"Customer":"Miceli Drapery "},{"Customer":"https://www.micelidrapery.com/"},{"Customer":"Econocare/LTC Interiors uses them and is happy"},{"Customer":"Mid-South Drapery"},{"Customer":"no known website"},{"Customer":"2/16/16 used by Hodell.  Tiffany Breda emailed PO to me unintentially.  Meant for Hanes for black-out with Mid-South as the recipient."},{"Customer":"MIP"},{"Customer":"https://www.mipinc.com/"},{"Customer":"8/23/18: Ryan forwarded email on Canadian best practices for curtains and MIP is mentioned as a supplier."},{"Customer":"On the Right Track "},{"Customer":"https://www.ontherighttrack.com/"},{"Customer":"linkedin: John DeWees co-founder and investor, Keil Merrick, Teddy Marcus partner"},{"Customer":"OR Focus Products Group (acquired Arcs & Angles, which led to OTRT), which was in turn acquired by Lifetime Brands"},{"Customer":"Phil-Tex "},{"Customer":"http://www.phil-tex.com/"},{"Customer":"5/11/12: Bobby Noon at APN mentioned that he uses them for CCs"},{"Customer":"Quality Stage Drapery "},{"Customer":"http://www.qualitystagedrapery.com/"},{"Customer":"Quiltcraft "},{"Customer":"http://www.quiltcraft.com/"},{"Customer":"Dallas-area"},{"Customer":"Read Window "},{"Customer":"https://www.readwindow.com"},{"Customer":"owned by Culp Hospitality https://www.culphospitality.com/"},{"Customer":"2/21/23: noticed Culp, Inc. (NYSE: CULP) today announced the company’s board of directors has approved a change in the executive management structure of the company, effective September 1, 2022. Franklin N. Saxon, the company’s current executive chairman and former chief executive officer, will alter his role and be less involved in the day to day management of the company. Mr. Saxon will remain as chairman of the board, and he will continue in his important role as a strategic advisor."},{"Customer":"3/4/19: Bill Ott of Encompass said that he has known CEO, Frank Saxon, since his days in public accounting and offered an intro."},{"Customer":"1/30/19: Jim Decker mentioned while touring Big Lake, MN that Read is part of a publicly traded company with $40mm of cash.  They thought that Read might be interested in Big Lake as a way to enter healthcare.  Didn't have much time to evaluate b/c of John Wood's Jan 31st deadline."},{"Customer":"  "},{"Customer":"RM Coco/Carr Textile: "},{"Customer":"https://www.semissourian.com/story/2260683.html.  "},{"Customer":"RM Coco has a workroom.  https://www.carrtextile.com/ "},{"Customer":"Renaissance Manufacturing (RMI)"},{"Customer":"https://rmi-sc.com/"},{"Customer":"8/16/22: stumbled across online"},{"Customer":"RMP Associates (Rooms Made Perfect)"},{"Customer":"www.rmpassociates.com"},{"Customer":"Salsbury Industries "},{"Customer":"http://www.hospitalhardware.com/"},{"Customer":"Schwimmer Drapery       "},{"Customer":"https://www.schwimmerdrapery.com/"},{"Customer":"8/2/22: Ryan email: 1 of Coral’s sources https://www.linkedin.com/in/jeff-schwimmer-6b263714/"},{"Customer":"6/3/22: Rene mentioned "},{"Customer":"Showtex"},{"Customer":"couldn't find online"},{"Customer":"Pennsylvania"},{"Customer":"9/4/18: Lou Gostino mentioned that this is Doug Lynn's go-to workroom.  Cheap and fast, quality not great."},{"Customer":"Silver Threads "},{"Customer":"http://www.silverthreadsinc.com/"},{"Customer":"5/11/17: Ron Swank said that she has tried to hire him and Teresa multiple times but he does not want to be in Ohio.  Also said that an investor group bought them. "},{"Customer":"SK Textile "},{"Customer":"http://www.sktextile.com"},{"Customer":"12/31/22: SK Textile is embarking on an adventure and joining Standard Textile's Interiors Group effective December 31, 2022"},{"Customer":"4/26/11: Mike Newton of Standard says that it is technically owned by the wife of the owner of Standard Textile"},{"Customer":"Spec-Tex "},{"Customer":"http://www.spec-tex.com/"},{"Customer":"10/8/20: talked with Adam Jurlin"},{"Customer":"9/12/13: met w/ Chuck Hogan of Architex - he walked us through his Diamond Drapery / Spec-Tex history.  Spec-Tex started by Diamond Drapery son, Adam.  Separate company, but Diamond Drapery did all of the fabrication.  Said that Adam is a genius but often misunderstood for being brash.  Spec-Tex ran out of money b/c grew too quickly.  Fabtex bought the rights to Spec-Tex  "},{"Customer":"Southwest Décor"},{"Customer":"http://www.southwestdecoronline.com/"},{"Customer":"San Antonio "},{"Customer":"8/18/10: Karla Jackson at StudioSIX5 mentioned that they use them for Texas projects"},{"Customer":"Standard Textile "},{"Customer":"http://www.standardtextile.com/"},{"Customer":"owner = Gary Heiman, http://www.uc.edu/trustees/trustees/g_heiman.html"},{"Customer":"Star Textile "},{"Customer":"http://www.startextile.com/"},{"Customer":"5/18/11: visited booth and met secretary at HD Expo.  Apparently hospitality only"},{"Customer":"Suncraft Drapery "},{"Customer":"www.suncraftdrapery.com"},{"Customer":"6/28/22 Ryan found Mark Robb on LI https://www.linkedin.com/in/mark-robb-5248a419/"},{"Customer":"Sunshine Drapery "},{"Customer":"https://sunshinedrapery.com/"},{"Customer":"5/10/17: Marcene Darby went to Invacare as an interior designer, spent 2 years at Sunshine"},{"Customer":"Superior Drapery "},{"Customer":"http://www.superiordrapery.com/spdrc.htm"},{"Customer":"Lou at Harbor has mentioned that Paul Lieberman now works for Harbor and that they \"bought\" Superior.  Bob Montani later said that they did not buy any assets, but really just hired Paul."},{"Customer":"11/17/09: Bill Thomas from Harbor mentioned that he currently gets bed covers made there"},{"Customer":"Tana-Tex "},{"Customer":"http://www.tana-tex.com/"},{"Customer":"8/27/13:  Rick Deacon said that Tony Tedesco, sales, passed away from colon cancer a few weeks ago"},{"Customer":"2/20/12: Lance Keziah at Crypton mentioned that Tony Tadesco is a big Crypton advocate.  Tony helped get Crypton into the healthcare industry when he was at Standard Textile."},{"Customer":"4/24/09 - Leah Brickl at Direct Supply emailed HCI but accidentally referenced Tana Tex"},{"Customer":"Thomas W Raftery "},{"Customer":"http://www.thomaswraftery.com/"},{"Customer":"7/12/11: McK emailed photo from doctor's office.  Looks like they sell direct"},{"Customer":"TI Associates "},{"Customer":"http://www.tiassoc.com"},{"Customer":"website history talks about selling directly to Beverly and Hillhaven Corporation of Tacoma, Wa.  References include HCR Manor Care, Golden Living, Tampa General Hospital Florida Health Sciences Center, Sunrise Senior Living"},{"Customer":"5/1/09 - Ashley Kent at Direct Supply mentioned that design team often uses TI Associates b/c offer measurement and install "},{"Customer":"TJ Snuggles"},{"Customer":"https://www.lci1.com/tj-snuggles"},{"Customer":"May 2022: T. J. Snuggles joined the Lippert family"},{"Customer":"4/17/12: shipped fabric on behalf of Invacare to them"},{"Customer":"4/27/11:  Rick at Interspec said that Medline is using them"},{"Customer":"5/21/10: John at MAK said that their curtains are crap"},{"Customer":"Tri-Tex "},{"Customer":"http://www.tri-tex.net/"},{"Customer":"including Medical Textiles, a division of Tri-tex "},{"Customer":"Dallas-based, although workroom out in the sticks"},{"Customer":"Donna (North? Letier?) works there now, Danna/John worked there in the past."},{"Customer":"Tuf-Tex "},{"Customer":"bedspreads for Star Linen and others"},{"Customer":"Unitex "},{"Customer":"www.unitexindustries.com "},{"Customer":"found thru Google"},{"Customer":"3/20/12: quote request to Danna from Peter Simmons for Seaspice fabric"},{"Customer":"7/8/10 noticed that they bid on State of Texas Cobblestone CC project"},{"Customer":"Unique Wholesale Distributors"},{"Customer":"https://uniquewholesale.net/"},{"Customer":"6/15/21: when I called Virginia Quilting at 434-447-5091, the caller ID is VQC but the general voicemail says something like “you have reached Unique Wholesale Distributors”.  Just did some googling…it appears that VQ may have been acquired by UWD."},{"Customer":"WCD Window Coverings, Inc"},{"Customer":"http://www.wcd-drapery.com/"},{"Customer":"Lake Katrine, NY "},{"Customer":"Drew Wonderly, dwonderly@wcd-drapery.com, cell 845-224-5339"},{"Customer":"https://www.dailyfreeman.com/2004/04/04/drapery-house-spins-off-from-family-company/"},{"Customer":"2/16/23: called Drew. Chatted 45 mins. Still interested in making big changes. Had someone ready to lease the building but dragging their feet. Me: What would you do with the business if someone leased the building? Probaby sell it. Me: No independent person wants to buy the business and find a new location. Scaled back from 60 employees to 28, office went from 8 to 3. He wants to retire but still do some work/be active. Doesn't want to do sales, manage people, hire and fire. Doesn't have any employee capable of running the company. He is mass production, doesn't take many people. $1 to $6mm, comfort zone is $2mm. 75% is COM, 95% is hospitality, doesn't think his largest customer is more than 10% but each year varies. Hasn't put a lot of thought into valuation, but if had to throw a dart on the board would say $500-700K for the business (not including the building)."},{"Customer":"8/29/22: video call with Drew, Ryan, and Phil. Discussed sending an NDA but concluded not to."},{"Customer":"Aug 2022: Phil, installer, connecting us with b/c he's interested in selling/retiring"},{"Customer":"American Dawn"},{"Customer":"https://americandawn.com/"},{"Customer":"9/29/22: Janet Gray asked if it'd be ok to give Tim my number."},{"Customer":"4/18/14: Tim Phippen connected and after explaining their business model, they don't sell direct, own manufacturing, Direct Supply is a big customer, etc he mentioned that they would be a great buyer of HCI.  Tim, etc, know the business from their Encompass/Lintex days."},{"Customer":"Antique Drapery Rod Company"},{"Customer":"https://www.antiquedraperyrod.com/"},{"Customer":"7/1/19: stumbled across on LinkedIn.  Did he buy the company?"},{"Customer":"Blaine Smith, Owner"},{"Customer":"Dallas, Texas"},{"Customer":"Owner at Antique Drapery Rod Company2017 – Present"},{"Customer":"Portfolio Manager at Invesco Real Estate1990 – 2015"},{"Customer":"Texas A&M University1982 – 1986"},{"Customer":"Southern Methodist University - Cox School of Business1986 – 1987"},{"Customer":"BTX"},{"Customer":"https://btxinc.com/"},{"Customer":"https://liftfundcdc.com/project/btx-davide-evangeline-pesca/: "},{"Customer":"Davide Pesca purchased BTX.   Since the purchase of the building, the revenue of BTX increased four times and they grew from nineteen to sixty employees."},{"Customer":"what's the relationship with Skyco Shade? see 7/25/22 email: Exciting Updates for BTX and Skyco"},{"Customer":"Calico Corners"},{"Customer":"https://www.calicocorners.com/"},{"Customer":"9/7/22: lunch with Bob Lipsky, LOI for Calico to buy Design District for around $2mm."},{"Customer":"Draper, Inc. "},{"Customer":"https://www.draperinc.com/"},{"Customer":"residential focus?"},{"Customer":"Hollander "},{"Customer":"https://hollandersleepdecor.com/"},{"Customer":"10/7/22: mentioned by Jorge Ramirez"},{"Customer":"Kimlor "},{"Customer":"https://www.kimlor.com/"},{"Customer":"Matt Svicarovich"},{"Customer":"VISI-ONE acquired the Kimlor Mills Textile facility in June of 2019, and continue to manufacture in house and national brands."},{"Customer":"Lippert "},{"Customer":"https://www.lci1.com/company/"},{"Customer":"Lippert is a leading, global manufacturer and supplier of highly engineered products and customized solutions, dedicated to shaping, growing and bettering the RV, marine, automotive, commercial vehicle and building products industries."},{"Customer":"May 2022: T. J. Snuggles joined the Lippert family"},{"Customer":"T. J. Snuggles has been manufacturing camper tents and other cut-and-sew solutions since 1968, primarily serving the RV industry and hospitality industry."},{"Customer":"Medline"},{"Customer":"https://www.medline.com/"},{"Customer":"Allen Thorpe (Stanford SAE) on the board via Hellman & Friedman "},{"Customer":"Dec 2017: John Hogan expressed interest"},{"Customer":"Phase II "},{"Customer":"https://www.phaseii.com/"},{"Customer":"4/13/20: email from Julie - Do you know these guys? Chris McCracken has handled their IT for quite some time… they are in Plano (customer service), have moved production to right over into Mexico – with San Diego management team; marketing in New York. They did all of the JCPenney fabrication….?"},{"Customer":"Rowley"},{"Customer":"https://www.rowleycompany.com/"},{"Customer":"10/5/22: visited Rowley Dallas facility. Met with John and CEO Bill Taylor. Bill seemed like decent guy and fun to hear about their acqusition of Rowley and how they have grown with both new organic products and acquisitions. He asked about our competitors. Asked about our interest in residential (I said \"moderate\", lower than hospitality), sounds like they' considering finding a manufacturing partner for WTs, wants to visit HCI. He moved to Dallas about a year ago as they consolidated into the new Dallas facility. "},{"Customer":"Bill Taylor is the CEO of Rowley Company, and has applied his success as a business investor to grow the company into new product lines and new channels of business. Bill has over 15 years of leadership experience in high growth markets such as ingredient branded technology, packaged goods, medical products, and sports and fitness industries. Prior to joining Rowley in November of 2007, Bill was Executive Vice President of Microban® International, Ltd. and President of Microban Products Company. Bill has previously held leadership positions with Anheuser-Busch, Inc., Nike and Clinitex Medical. He is a former world-class athlete who competed on several U.S. National Teams including three U.S. World Cross Country Championship Teams. Bill received a B.A.A. in Exercise Science & Physiology from Central Michigan University and a M.B.A. from the McColl Graduate School of Business at Queens University of Charlotte."},{"Customer":"8/31/22: John Akerman visited HCI to meet with Ryan and I said hi.  Owners are 3 guys who sounds like bought and have grown the business.  Starting to fabricate things but unlikely they would ever want to fabricate WTs.  Told him they could buy HCI but more realistically asked him to keep us in mind if he sees competitors who would be acquisition candidates for us.  "},{"Customer":"Shade Store, The"},{"Customer":"https://www.theshadestore.com/"},{"Customer":"May 2021: Michelle B said that installers, designers, etc mentioned on facebook that Anderson Fabrics has been acquired by The Shade Store."},{"Customer":"Private equity firm Leonard Green & Partners is acquiring customized treatment company The Shade Store. Terms were not announced, but CNBC has learned the deal is worth $325 million. The Shade Store sells its custom-made window treatments online and in 60 showrooms across the country.Aug 9, 2018"},{"Customer":"Leonard Green nears acquisition of The Shade Store - CNBC"},{"Customer":"Sleeptronic"},{"Customer":"https://www.sleeptronic.com/"},{"Customer":"Rizwan Sunderji"},{"Customer":"EO Member"},{"Customer":"5/13/19: visited Riz at Sleeptronic.  He would like to get out of day to day and invest.  Sounds like he is more interested in real estate than operating companies."},{"Customer":"Smith & Noble"},{"Customer":"https://www.smithandnoble.com/"},{"Customer":"owned by IAC (nasdaq iaci stock)"},{"Customer":"Springs Global"},{"Customer":"https://ri.springs.com/en/"},{"Customer":"10/7/22: mentioned by Jorge Ramirez, he worked there and helped set up sewing operations in Mexico."},{"Customer":"Westpoint Home / Martex"},{"Customer":"https://westpointhome.com/"},{"Customer":"12/9/11: learned that Sung is at Icahn and works with Westpoint Home"},{"Customer":"Woodbridge International"},{"Customer":"https://woodbridgegrp.com/"},{"Customer":"2/25/23: emailed Catherine to learn more"},{"Customer":"1/21/19: marketing email from Catherine Bucci <catherine@woodbridgegrp.com that selling a \"Designer and Manufacturer of State-of-the-Art Custom Window Solutions for Commercial and Residential Clients"},{"Customer":"Revenue: $16.2 million, EBITDA: $3.5 million, East and West Coast U.S.\"  Googled and guessing that the company is https://www.rollashade.com/.  Perhaps the buyer would be interested in purchasing HCI someday."}]]